In [1]:
import pandas as pd
import numpy as np

In [2]:
salary = pd.read_csv('FTE_Salary.csv')

In [3]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
Institution Name                                                                                  11 non-null object
Average salary equated to 9 months of full-time instructional staff - all ranks (DRVHR2016)       11 non-null int64
Average salary equated to 9 months of full-time instructional staff - all ranks (DRVHR2015_RV)    11 non-null int64
Average salary equated to 9 months of full-time instructional staff - all ranks (DRVHR2014_RV)    11 non-null int64
Average salary equated to 9 months of full-time instructional staff - all ranks (DRVHR2013_RV)    11 non-null int64
Average salary equated to 9 months of full-time instructional staff - all ranks (DRVHR2012_RV)    11 non-null int64
dtypes: int64(5), object(1)
memory usage: 608.0+ bytes

In [4]:
col_names = ['Institution Name', '2016', '2015', '2014', '2013', '2012']

In [5]:
salary.columns = col_names

In [6]:
salary.head()

                   Institution Name   2016   2015   2014   2013   2012
0    Arizona State University-Tempe  99711  98469  95823  93645  86580
1  Florida International University  90981  89307  87003  86877  83736
2           George Mason University  95081  95508  94194  94716  91620
3          Georgia State University  77508  77220  74223  64341  70470
4         Portland State University  78640  78912  73089  74574  72522

In [7]:
peers = salary[salary['Institution Name'] != 'The University of Texas at San Antonio'].drop('Institution Name',axis=1)

In [8]:
medians = { 'Institution Name': 'Median'}

In [9]:
for column in peers:
    medians[column] = peers[column].median()

In [10]:
medians

{'Institution Name': 'Median',
 '2016': 93031.0,
 '2015': 92407.5,
 '2014': 90684.0,
 '2013': 90261.0,
 '2012': 85158.0}

In [11]:
median_df = pd.DataFrame([medians])

In [12]:
UTSA = salary[salary['Institution Name'] == 'The University of Texas at San Antonio']

In [13]:
UTSA

                         Institution Name   2016   2015   2014   2013   2012
5  The University of Texas at San Antonio  79403  84483  68103  83448  80991

In [14]:
median_df = median_df.append(UTSA)

C:\Users\rzz934\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

In [15]:
median_df

,2012,2013,2014,2015,2016,Institution Name
0,85158.0,90261.0,90684.0,92407.5,93031.0,Median
5,80991.0,83448.0,68103.0,84483.0,79403.0,The University of Texas at San Antonio

In [16]:
test_df = pd.melt(median_df, id_vars="Institution Name", var_name='Year', value_name='FTE Salary')

In [17]:
test_df = test_df.sort_values(['Institution Name'])

In [18]:
test_df

                         Institution Name  Year  FTE Salary
0                                  Median  2012     85158.0
2                                  Median  2013     90261.0
4                                  Median  2014     90684.0
6                                  Median  2015     92407.5
8                                  Median  2016     93031.0
1  The University of Texas at San Antonio  2012     80991.0
3  The University of Texas at San Antonio  2013     83448.0
5  The University of Texas at San Antonio  2014     68103.0
7  The University of Texas at San Antonio  2015     84483.0
9  The University of Texas at San Antonio  2016     79403.0

In [19]:
test_df['Median'] = test_df[test_df['Institution Name']=='Median']['FTE Salary']

In [20]:
test_df['The University of Texas at San Antonio'] = test_df[test_df['Institution Name']=='The University of Texas at San Antonio']['FTE Salary']

In [21]:
test_df

,Institution Name,Year,FTE Salary,Median,The University of Texas at San Antonio
0,Median,2012,85158.0,85158.0,NaN
2,Median,2013,90261.0,90261.0,NaN
4,Median,2014,90684.0,90684.0,NaN
6,Median,2015,92407.5,92407.5,NaN
8,Median,2016,93031.0,93031.0,NaN
1,The University of Texas at San Antonio,2012,80991.0,NaN,80991.0
3,The University of Texas at San Antonio,2013,83448.0,NaN,83448.0
5,The University of Texas at San Antonio,2014,68103.0,NaN,68103.0
7,The University of Texas at San Antonio,2015,84483.0,NaN,84483.0
9,The University of Texas at San Antonio,2016,79403.0,NaN,79403.0

In [22]:
median = test_df.drop(['Institution Name','FTE Salary','The University of Texas at San Antonio'],axis=1)

In [23]:
UTSA = test_df.drop(['Institution Name','FTE Salary','Median'],axis=1)

In [26]:
UTSA.dropna(axis=0,inplace=True)
median.dropna(axis=0,inplace=True)

In [28]:
median_df = pd.merge(median,UTSA,how='inner',on='Year')

In [29]:
median_df = median_df.sort_values('Year')

In [31]:
median_col = ['Year', 'Median','UTSA']

In [32]:
median_df.columns = median_col

In [35]:
# writer = pd.ExcelWriter('FTE Salary.xlsx')
# median_df.to_excel(writer,'FTE Sal')
# writer.save()